LonelyWolf/stm32/stm32l151rdt6-dev/GPS.c
#include <stm32l1xx_rcc.h>
#include <string.h> // For memset

#include <delay.h>
#include <uart.h>
#include <wolk.h>
#include <GPS.h>


GPS_Data_TypeDef GPSData;                   // Parsed GPS information
bool GPS_new_data;                          // TRUE if received new GPS packet
bool GPS_parsed;                            // TRUE if GPS packets was parsed
uint16_t GPS_buf_cntr;                      // Number of actual bytes in GPS buffer
NMEASentence_TypeDef GPS_msg;               // NMEA sentence position
uint8_t GPS_sentences_parsed;               // Parsed NMEA sentences counter
uint8_t GPS_sentences_unknown;              // Found unknown NMEA sentences counter
uint8_t GPS_buf[GPS_BUFFER_SIZE];           // Buffer with data from GPS
uint8_t GPS_sats[12];                       // IDs of satellites used in position fix
// Information about satellites in view (can be increased if receiver able handle more)
GPS_Satellite_TypeDef GPS_sats_view[MAX_SATELLITES_VIEW];
GPS_PMTK_TypeDef GPS_PMTK;                  // PMTK messages result


// Calculates ten raised to the specified power
// input:
//   exp - degree value
// return: ten raised to the specified power
uint32_t pwr10(uint32_t exp) {
	uint32_t result = 1;

	while (exp--) result *= 10;

	return result;
}

// Calculate the CRC value of NMEA sentence
// input:
//   str - pointer to the buffer containing sentence
// return:
//   checksum of sentence
// note: sentence must begin with '$' char and end with '*' or zero symbol
uint8_t GPS_CRC(char *str) {
	uint8_t result = 0;

	if (*str++ == '$') while (*str != '*' && *str != '\0') result ^= *str++;

	return result;
}

// Send NMEA sentence
// input:
//   cmd - pointer to the buffer containing sentence
// note: sentence must begin with '$' char and end with '*'
void GPS_Send(char *cmd) {
	uint8_t cmd_CRC;

	cmd_CRC = GPS_CRC(cmd);
	UART_SendStr(GPS_USART_PORT,cmd);
	UART_SendChar(GPS_USART_PORT,HEX_CHARS[cmd_CRC >> 4]);
	UART_SendChar(GPS_USART_PORT,HEX_CHARS[cmd_CRC & 0x0f]);
	UART_SendChar(GPS_USART_PORT,'\r');
	UART_SendChar(GPS_USART_PORT,'\n');

	// Wait for an USART transmit complete
	while (!(GPS_USART_PORT->SR & USART_SR_TC));
}

// Find end of the GPS sentence
// input:
//   buf - pointer to the data buffer
//   buf_size - size of the data buffer
// return: buffer offset
uint16_t GPS_FindTail(uint8_t *buf, uint16_t buf_size) {
	uint16_t pos = 0;
	uint16_t crlf;

	do {
		crlf = (buf[pos] << 8) | buf[pos + 1];
		pos++;
	} while (crlf != 0x0d0a && (pos + 1) < buf_size);

	return pos;
}

// Find next field in GPS sentence
// input:
//   buf - pointer to the data buffer
// return: buffer offset of next field
uint16_t GPS_NextField(uint8_t *buf) {
	uint16_t pos = 1;

	while (*buf != ',' && *buf++ != '*') pos++;

	return pos;
}

// Find NMEA sentence in buffer
// input:
//   msg - pointer to NMEASentence variable
//   buf - pointer to buffer with NMEA packet
//   start - position in buffer to start search
//   buf_size - size of the data buffer
// note: function modifies msg variable
void GPS_FindSentence(NMEASentence_TypeDef *Sentence, uint8_t *buf, uint16_t start, uint16_t buf_size) {
	uint16_t pos = start;
	uint32_t hdr;

	Sentence->start = start;
	Sentence->end   = buf_size;
	Sentence->type  = NMEA_BAD;

	if (start + 10 > buf_size) return;

	do {
		hdr = (buf[pos] << 16) | (buf[pos + 1] << 8) | buf[pos + 2];
		if (hdr == 0x00244750) {
			// $GPxxx sentence - GPS
			Sentence->start = pos + 7;
			hdr = (buf[pos + 3] << 16) |
				  (buf[pos + 4] << 8)  |
				   buf[pos + 5];
			pos += GPS_FindTail(&buf[pos],buf_size);
			if (pos >= buf_size) return;
			Sentence->end = pos + 1;
			if (hdr == 0x00474c4c) { Sentence->type = NMEA_GLL; return; }
			if (hdr == 0x00524d43) { Sentence->type = NMEA_RMC; return; }
			if (hdr == 0x00565447) { Sentence->type = NMEA_VTG; return; }
			if (hdr == 0x00474741) { Sentence->type = NMEA_GGA; return; }
			if (hdr == 0x00475341) { Sentence->type = NMEA_GSA; return; }
			if (hdr == 0x00475356) { Sentence->type = NMEA_GSV; return; }
			if (hdr == 0x005a4441) { Sentence->type = NMEA_ZDA; return; }

			return;
/*
		} else if (hdr == 0x0024474e) {
			// $GNxxx sentence - GLONASS
			Sentence->start = pos + 7;
			hdr = (buf[pos + 3] << 16) |
				  (buf[pos + 4] << 8)  |
				   buf[pos + 5];
			pos += GPS_FindTail(&buf[pos],buf_size);
			if (pos >= buf_size) return;
			Sentence->end = pos + 1;

			return;
*/
		} else if (hdr == 0x0024504d) {
			// $PMTK sentence
			Sentence->start = pos + 9;
			hdr = (buf[pos + 4] << 24) |
				  (buf[pos + 5] << 16) |
				  (buf[pos + 6] << 8)  |
				   buf[pos + 7];
			pos += GPS_FindTail(&buf[pos],buf_size);
			if (pos >= buf_size) return;
			Sentence->end = pos + 1;
			if (hdr == 0x4b303031) { Sentence->type = NMEA_PMTK001; return; }
			if (hdr == 0x4b303130) { Sentence->type = NMEA_PMTK010; return; }
			if (hdr == 0x4b303131) { Sentence->type = NMEA_PMTK011; return; }

			return;
		}
		pos++;
	} while (pos < buf_size - 3);

	return;
}

// Parse float value from a GPS sentence
// input:
//   buf - pointer to the data buffer
//   value - pointer to parsed value (float represented as integer, e.g. 1234.567 -> 1234567)
// return: number of parsed bytes
uint16_t GPS_ParseFloat(uint8_t *buf, uint32_t *value) {
	uint16_t pos = 0;
	uint32_t ip;
	uint16_t len;

	if (*buf == ',' || *buf == '*') {
		*value = 0;
		return 1;
	}
	ip = atos_char(&buf[pos],&pos); // integer part
	if (buf[pos - 1] == '.') {
		// fractional part
		len = pos;
		*value  = atos_char(&buf[pos],&pos);
		*value += ip * pwr10(pos - len - 1);
	} else {
		// this value is not float
		*value = ip;
	}

	return pos;
}

// Parse latitude or longitude coordinate
// input:
//   buf - pointer to the data buffer
//   len - length of the degrees value (2 for latitude, 3 for longitude)
//   value - pointer to the coordinate variable
//   char_value - pointer to the coordinate character variable
// return: number of parsed bytes
uint16_t GPS_ParseCoordinate(uint8_t *buf, uint8_t len, uint32_t *value, uint8_t *char_value) {
	uint16_t pos = 0;
	uint32_t coord_minutes;
	int16_t f_len; // fractional part length

	// Coordinate
	if (buf[pos] != ',') {
		// '1000000' determines length of the fractional part in result
		// e.g. 1000000 means 6 fractional digits
		*value = atos_len(&buf[pos],len) * 1000000; // degrees
		pos += len;
		f_len = pos;
		pos += GPS_ParseFloat(&buf[pos],&coord_minutes); // minutes
		f_len = pos - f_len - 4; // fractional part length
		if (f_len > 0) {
			// Float calculations, slow
			*value += (uint32_t)((coord_minutes / (pwr10(f_len) * 60.0)) * 1000000);
		} else {
			// Are you serious? Floating part is mandatory!
			*value += coord_minutes * 100;
		}
	} else pos++;

