LonelyWolf/stm32/stm32l151rdt6-dev/GPS.c
	// Coordinate character
	if (buf[pos] != ',') {
		*char_value = buf[pos];
		pos += 2;
	} else {
		*char_value = 'X';
		pos++;
	}

	// FIXME: coordinate must be negative in case when char_value is 'W' or 'S'

	return pos;
}

// Parse one satellite from $GPGSV sentence
// input:
//   buf - pointer to the data buffer
//   set_num - satellite number in GPS_sats_view[]
// return: number of parsed bytes
uint16_t GPS_ParseSatelliteInView(uint8_t *buf, uint8_t sat_num) {
	uint16_t pos = 0;

	// Satellite PRN number
	if (buf[pos] != ',') {
		GPS_sats_view[sat_num].PRN = atos_len(&buf[pos],2);
		pos += 3;
	} else {
		GPS_sats_view[sat_num].PRN = 0;
		pos++;
	}

	// Satellite elevation
	if (buf[pos] != ',') {
		GPS_sats_view[sat_num].elevation = atos_len(&buf[pos],2);
		pos += 3;
	} else {
		GPS_sats_view[sat_num].elevation = 0;
		pos++;
	}

	// Satellite azimuth
	if (buf[pos] != ',') {
		GPS_sats_view[sat_num].azimuth = atos_len(&buf[pos],3);
		pos += 4;
	} else {
		GPS_sats_view[sat_num].azimuth = 0;
		pos++;
	}

	// Satellite SNR
	if (buf[pos] != ',' && buf[pos] != '*') {
		GPS_sats_view[sat_num].SNR = atos_len(&buf[pos],2);
		pos += 3;
	} else {
		GPS_sats_view[sat_num].SNR = 255; // Satellite not tracked
		pos++;
	}

	// This must be set after all GPS sentences parsed
	GPS_sats_view[sat_num].used = FALSE;

	return pos;
}

// Parse time from NMEA sentence
// input:
//   buf - pointer to the data buffer
//   time - pointer to variable where time will be stored
// return: number of parsed bytes
uint16_t GPS_ParseTime(uint8_t *buf, uint32_t *time) {
	uint16_t pos = 0;

	// Parse time
	*time  = atos_len(&buf[pos],2) * 3600;
	pos += 2;
	*time += atos_len(&buf[pos],2) * 60;
	pos += 2;
	*time += atos_len(&buf[pos],2);
	pos += 3;
	pos += GPS_NextField(&buf[pos]); // Ignore milliseconds

	return pos;
}

// Parse NMEA sentence
// input:
//   buf - pointer to the data buffer
//   Sentence - pointer to the structure with NMEA sentence parameters
void GPS_ParseSentence(uint8_t *buf, NMEASentence_TypeDef *Sentence) {
	uint16_t pos = Sentence->start;
	uint8_t i;
	uint8_t GSV_msg;   // GSV sentence number
	uint8_t sat_num;   // Satellites quantity in sentence
	uint8_t GSV_sats;  // Total number of satellites in view
	uint32_t ui_32;
	uint16_t ui_16;

	switch (Sentence->type) {
	case NMEA_RMC:
		// $GPRMC - Recommended minimum specific GPS/Transit data

		// Time of fix
		if (buf[pos] != ',') pos += GPS_ParseTime(&buf[pos],&GPSData.fix_time); else pos++;

		// Valid data marker
		GPSData.valid = FALSE;
		if (buf[pos] != ',') {
			if (buf[pos] == 'A') GPSData.valid = TRUE;
			pos += 2;
		} else pos++;

		// Latitude
		pos += GPS_ParseCoordinate(&buf[pos],2,&GPSData.latitude,&GPSData.latitude_char);

		// Longitude
		pos += GPS_ParseCoordinate(&buf[pos],3,&GPSData.longitude,&GPSData.longitude_char);

		// Horizontal speed (in knots)
		pos += GPS_ParseFloat(&buf[pos],&GPSData.speed_k);

		// Convert speed in knots to speed in km/h
		if (GPSData.speed == 0 && GPSData.speed_k != 0) GPSData.speed = (GPSData.speed_k * 1852) / 1000;

		// Course
		pos += GPS_ParseFloat(&buf[pos],&GPSData.course);

		// Date of fix
		if (buf[pos] != ',') {
			GPSData.fix_date  = atos_len(&buf[pos],2) * 1000000; // Day
			GPSData.fix_date += atos_len(&buf[pos + 2],2) * 10000; // Month
			i = atos_len(&buf[pos + 4],2); // Year (two digits)
			// Some receivers report date year as 70 or 80 when their internal clock has
			// not yet synchronized with the satellites
			// So this trick wouldn't work after 2069 year ^_^
			if (i > 69) {
				// Assume what year is less than 2000
				GPSData.fix_date += i + 1900;
			} else {
				// Assume what year is greater than 2000
				// Assign fix_date as date in case if $GPZDA sentence are disabled
				GPSData.fix_date += i + 2000;
				GPSData.date = GPSData.fix_date;
				GPSData.time = GPSData.fix_time;
				GPSData.datetime_valid = TRUE;
			}
			pos += 6;
		} pos++;

		// Magnetic variation
		// ignore this (mostly not supported by GPS receivers)
		pos += GPS_NextField(&buf[pos]);

		// Magnetic variation direction
		// ignore this (mostly not supported by GPS receivers)
		pos += GPS_NextField(&buf[pos]);

		// Mode indicator (NMEA 0183 v3.0 or never)
		if (buf[pos] != ',' && buf[pos] != '*') GPSData.mode = buf[pos];

		break; // NMEA_RMC
	case NMEA_GLL:
		// $GPGLL - Geographic position, latitude / longitude

		// Latitude
		pos += GPS_ParseCoordinate(&buf[pos],2,&GPSData.latitude,&GPSData.latitude_char);

		// Longitude
		pos += GPS_ParseCoordinate(&buf[pos],3,&GPSData.longitude,&GPSData.longitude_char);

		// Time of fix
		if (buf[pos] != ',') pos += GPS_ParseTime(&buf[pos],&GPSData.fix_time); else pos++;

		// Valid data marker
		GPSData.valid = FALSE;
		if (buf[pos] != ',') {
			if (buf[pos] == 'A') GPSData.valid = TRUE;
			pos += 2;
		} else pos++;

		// Mode indicator
		if (buf[pos] != ',') GPSData.mode = buf[pos]; else GPSData.mode = 'N';

		break; // NMEA_GLL
	case NMEA_ZDA:
		// $GPZDA - Date & Time

		// Time
		if (buf[pos] != ',') pos += GPS_ParseTime(&buf[pos],&GPSData.time); else pos++;

		// Date: day
		if (buf[pos] != ',') {
			GPSData.date = atos_len(&buf[pos],2) * 1000000;
			pos += 3;
		} else {
			GPSData.date = 1000000;
			pos++;
		}

		// Date: month
		if (buf[pos] != ',') {
			GPSData.date += atos_len(&buf[pos],2) * 10000;
			pos += 3;
		} else {
			GPSData.date += 10000;
			pos++;
		}

		// Date: year
		if (buf[pos] != ',') {
			GPSData.date += atos_len(&buf[pos],4);
		} else GPSData.date += 2013;

		// Local time zone offset
		// sad but true: this feature mostly not supported by GPS receivers

		// Check for year, if it less than 2014, the date from the GPS receiver is not valid
		if (GPSData.date % 10000 > 2013) GPSData.datetime_valid = TRUE;

		break; // NMEA_ZDA
	case NMEA_VTG:
		// $GPVTG - Course over ground and ground speed

		// Course (heading relative to true north)
		pos += GPS_ParseFloat(&buf[pos],&GPSData.course);

		// Field with 'T' letter - "track made good is relative to true north"
		// ignore it
		pos += GPS_NextField(&buf[pos]);

