LonelyWolf/stm32/stm32l151rdt6-dev/GPS.c
		// Field with course relative to magnetic north
		// mostly not supported by GPS receivers, ignore it
		pos += GPS_NextField(&buf[pos]);

		// Field with 'M' letter - "track made good is relative to magnetic north"
		// mostly not supported by GPS receivers, ignore it
		pos += GPS_NextField(&buf[pos]);

		// Speed over ground in knots
		pos += GPS_ParseFloat(&buf[pos],&GPSData.speed_k);

		// Convert speed in knots to speed in km/h
		if (GPSData.speed == 0 && GPSData.speed_k != 0) GPSData.speed = (GPSData.speed_k * 1852) / 1000;

		// Field with 'N' - speed over ground measured in knots, ignore it
		pos += GPS_NextField(&buf[pos]);

		// Speed over ground in km/h
		pos += GPS_ParseFloat(&buf[pos],&GPSData.speed);

		// Field with 'K' - speed over ground measured in km/h, ignore it
		pos += GPS_NextField(&buf[pos]);

		// Mode indicator (NMEA 0183 v3.0 or later)
		if (buf[pos] != ',' && buf[pos] != '*') GPSData.mode = buf[pos]; else GPSData.mode = 'N';

		break; // NMEA_VTG
	case NMEA_GGA:
		// $GPGGA - GPS fix data

		// Time
		if (buf[pos] != ',') pos += GPS_ParseTime(&buf[pos],&GPSData.time); else pos++;

		// Latitude
		pos += GPS_ParseCoordinate(&buf[pos],2,&GPSData.latitude,&GPSData.latitude_char);

		// Longitude
		pos += GPS_ParseCoordinate(&buf[pos],3,&GPSData.longitude,&GPSData.longitude_char);

		// Position fix indicator
		if (buf[pos] != ',') {
			GPSData.fix_quality = buf[pos] - '0';
			pos += 2;
		} else pos++;

		// Satellites used
		if (buf[pos] != ',') GPSData.sats_used = atos_char(&buf[pos],&pos); else pos++;

		// HDOP - horizontal dilution of precision
		pos += GPS_ParseFloat(&buf[pos],&GPSData.HDOP);

		// MSL Altitude (mean-sea-level)
		if (buf[pos] != ',') {
			// This value can be negative
			// Only integer part, fractional is useless
			GPSData.altitude = atos_char(&buf[pos],&pos);
			pos += GPS_NextField(&buf[pos]);
/*
			GPSData.altitude  = atos_char(&buf[pos],&pos) * 1000;
			if (GPSData.altitude >= 0)
				GPSData.altitude += atos_len(&buf[pos],3);
			else
				GPSData.altitude -= atos_len(&buf[pos],3);
			pos += 4;
*/
		} else pos++;

		// Altitude measurement units
		// ignore this field and assume what units is meters
		buf += GPS_NextField(&buf[pos]);

		// Geoid-to-ellipsoid separation (Ellipsoid altitude = MSL altitude + Geoid separation)
		if (buf[pos] != ',') {
			// This value can be negative
			GPSData.geoid_separation = atos_char(&buf[pos],&pos) * 1000;
			if (GPSData.geoid_separation >= 0)
				GPSData.geoid_separation += atos_char(&buf[pos],&pos);
			else
				GPSData.geoid_separation -= atos_char(&buf[pos],&pos);
		} else pos++;

		// Time since last DGPS update
		if (buf[pos] != ',') {
			GPSData.dgps_age = atos_char(&buf[pos],&pos);
		} else pos++;

		// DGPS station ID
		if (buf[pos] != ',' && buf[pos] != '*') {
			GPSData.dgps_id = atos_char(&buf[pos],&pos);
		}

		break; // NMEA_GGA
	case NMEA_GSA:
		// $GPGSA - GPS DOP and active satellites

		// Satellite acquisition mode (M = manually forced 2D or 3D, A = automatic switch between 2D and 3D)
		// ignore this field
		pos += GPS_NextField(&buf[pos]);

		// Position mode (1=fix not available, 2=2D fix, 3=3D fix)
		if (buf[pos] != ',') {
			GPSData.fix = buf[pos] - '0';
			pos += 2;
		} else {
			GPSData.fix = 1;
			pos++;
		}

		// IDs of satellites used in position fix (12 fields)
		for (i = 0; i < 12; i++) {
			if (buf[pos] != ',') {
				GPS_sats[i] = atos_len(&buf[pos],2);
				pos += 3;
			} else {
				GPS_sats[i] = 0;
				pos++;
			}
		}

		// PDOP - position dilution
		// In theory this thing must be equal to SQRT(pow(HDOP,2) + pow(VDOP,2))
		pos += GPS_ParseFloat(&buf[pos],&GPSData.PDOP);
		GPSData.accuracy = GPSData.PDOP * GPS_DOP_FACTOR;

		// HDOP - horizontal position dilution
		pos += GPS_ParseFloat(&buf[pos],&GPSData.HDOP);

		// VDOP - vertical position dilution
		pos += GPS_ParseFloat(&buf[pos],&GPSData.VDOP);

		break; // NMEA_GSA
	case NMEA_GSV:
		// $GPGSV - GPS Satellites in view

		// Field with "total number of GSV sentences in this cycle"
		// ignore it
		pos += GPS_NextField(&buf[pos]);

		// GSV sentence number
		if (buf[pos] != ',') {
			GSV_msg = atos_len(&buf[pos],1);
			pos += 2;
		} else {
			pos++;
			GSV_msg = 0;
		}

		// Total number of satellites in view
		if (buf[pos] != ',') {
			GSV_sats = atos_len(&buf[pos],2);
			pos += 3;
		} else {
			GSV_sats = 0;
			pos++;
		}

		GPSData.sats_view = GSV_sats;

		// Parse no more than 12 satellites in view
		sat_num = (GSV_msg - 1) * 4;
		if (GSV_sats != 0 && sat_num < MAX_SATELLITES_VIEW) {
			// 4 satellites per sentence
			pos += GPS_ParseSatelliteInView(&buf[pos],sat_num++);
			pos += GPS_ParseSatelliteInView(&buf[pos],sat_num++);
			pos += GPS_ParseSatelliteInView(&buf[pos],sat_num++);
			pos += GPS_ParseSatelliteInView(&buf[pos],sat_num++);
		}

		break; // NMEA_GSV
	case NMEA_PMTK001:
		// $PMTK001 - PMTK_ACK

		if (buf[pos] != ',') {
			GPS_PMTK.PMTK001_CMD  = atos_char(&buf[pos],&pos);
			GPS_PMTK.PMTK001_FLAG = atos_len(&buf[pos],1);
		} else {
			GPS_PMTK.PMTK001_CMD  = 0;
			GPS_PMTK.PMTK001_FLAG = 0;
		}

		break; // NMEA_PMTK001
	case NMEA_PMTK010:
		// $PMTK010 - PMTK_SYS_MSG

		if (buf[pos] != ',') {
			GPS_PMTK.PMTK010 = atos_char(&buf[pos],&pos);
		} else GPS_PMTK.PMTK010 = 0;

		break; // NMEA_PMTK010
	case NMEA_PMTK011:
		// $PMTK011 - PMTK_BOOT

		if (buf[pos] != ',') {
			memcpy(&ui_32,&buf[pos],4);
			memcpy(&ui_16,&buf[pos + 4],2);
		}
		GPS_PMTK.PMTK_BOOT = (ui_32 == 0x474b544d && ui_16 == 0x5350);

		break; // NMEA_PMTK011
	default:
		// Unknown NMEA sentence
		break;
	}
}

// Initialize GPSData variable
void GPS_InitData(void) {
	uint32_t i;

	memset(&GPSData,0,sizeof(GPSData));
	for (i = 0; i < 12; i++) GPS_sats[i] = 0;
	for (i = 0; i < MAX_SATELLITES_VIEW; i++) {
		memset(&GPS_sats_view[i],0,sizeof(GPS_Satellite_TypeDef));
		GPS_sats_view[i].SNR = 255;
	}
	GPSData.longitude_char = 'X';
	GPSData.latitude_char  = 'X';
	GPSData.mode = 'N';

	GPS_sentences_parsed = 0;
	GPS_sentences_unknown = 0;

